Tekla.Structures.Dialog.UIControls.ImageItem
The ImageItem class defines the images that will be contained in the image combo box.

Tekla.Structures.Dialog.UIControls.ImageItem.#ctor
Creates a new instance of the ImageItem class.

Tekla.Structures.Dialog.UIControls.ImageItem.#ctor(System.Drawing.Image,System.String)
Creates a new instance of the ImageItem class.
Image: The image to be used to create the new ImageItem.
Name: The name of the new ImageItem.

Tekla.Structures.Dialog.UIControls.ImageItem.Picture
Gets or sets the image.

Tekla.Structures.Dialog.UIControls.ImageItem.Name
Gets or sets the image name.

Tekla.Structures.Dialog.UIControls.ImageItem.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)


Tekla.Structures.Dialog.UIControls.ImageItem.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
